{
  "movies": [
    {
      "id": 1,
      "name": "Убить Билла? часть 1",
      "releaseYear": 2003,
      "poster": [],
      "genres": [
        "боевик",
        "триллер",
        "драма",
        "криминал"
      ],
      "viewed": false,
      "description": "В беременную наемную убийцу по кличке Черная Мамба во время бракосочетания стреляет человек по имени Билл. Пуля в голове жертвы, кровь на подвенечном платье, темнота...",
      "favorite": false
    },
    {
      "id": 2,
      "name": "Интерстеллар",
      "releaseYear": 2014,
      "poster": [
        "http://localhost:3000/posters/WD9QifBjDSZH_6fGa2t3w--1920x (6).webp"
      ],
      "genres": [
        "научная фантастика",
        "приключения"
      ],
      "viewed": true,
      "description": "Фантастический эпос про задыхающуюся Землю, космические полеты и парадоксы времени. «Оскар» за спецэффекты.",
      "favorite": true
    },
    {
      "id": 3,
      "name": "Мстители. Финал",
      "releaseYear": 2019,
      "poster": [],
      "genres": [
        "фантастика",
        "боевик",
        "приключения"
      ],
      "viewed": true,
      "description": "Оставшиеся в живых члены команды Мстителей и их союзники должны разработать новый план, который поможет противостоять разрушительным действиям могущественного титана Таноса. После наиболее масштабной и трагической битвы в истории они не могут допустить ошибку.",
      "favorite": true
    },
    {
      "name": "Терминатор",
      "releaseYear": 1995,
      "genres": [
        "фантастика",
        "боевик",
        "приключения"
      ],
      "description": "В будущем роботы захватили человечество человечество ",
      "poster": [],
      "id": 4,
      "viewed": false,
      "favorite": true
    },
    {
      "name": "Человек-паук",
      "releaseYear": 2010,
      "genres": [
        "фантастика",
        "боевик"
      ],
      "poster": [],
      "description": "Человека укусил паук и теперь он пукает паутиной",
      "id": 6,
      "viewed": false,
      "favorite": true
    },
    {
      "name": "Меган",
      "releaseYear": 2022,
      "genres": [
        "ужасы",
        "фантастика"
      ],
      "poster": [],
      "description": "10-летняя Кэди вместе с папой и мамой попадает в автоаварию. Родители погибают, а девочка отправляется жить к тёте Джемме — сотруднице корпорации по производству технологичных игрушек. Не зная, как справиться с внезапно свалившейся на неё ответственностью, и не особо желая тратить на племянницу время, Джемма знакомит Кэди с экспериментальной куклой-андроидом М3ган, обладающей искусственным интеллектом. Первостепенной задачей новой «подружки» является защита ребёнка от всевозможного физического и морального вреда, и М3ган понимает это слишком буквально.",
      "viewed": true,
      "favorite": false,
      "id": 8
    },
    {
      "name": "Терминатор: Да придёт спаситель",
      "releaseYear": 2009,
      "genres": [
        "фантастика",
        "боевик",
        "приключения"
      ],
      "poster": [],
      "description": "Коннор должен понять, кто такой этот Маркус и с какой целью пожаловал к людям. И на фоне подготовки Скайнетом решающего удара, Коннор и Райт отправляются в путешествие, приводящее их в самую сердцевину взбунтовавшейся операционной системы, где открывается ужасная тайна, кроющаяся за потенциальным уничтожением человечества.",
      "viewed": false,
      "favorite": true,
      "id": 9
    },
    {
      "name": "Терминатор: Генезис",
      "releaseYear": 2015,
      "genres": [
        "фантастика",
        "боевик",
        "триллер"
      ],
      "poster": [],
      "description": "Когда Джон Коннор, лидер сопротивления, посылает сержанта Кайла Риза назад в 1984 год, чтобы защитить Сару Коннор и спасти будущее, неожиданный поворот событий создает разлом во времени. Сержант Риз оказывается в новой, незнакомой версии прошлого, где он встречает неожиданных союзников, в том числе Терминатора, новых опасных врагов, и новую миссию: изменить будущее...",
      "viewed": true,
      "favorite": true,
      "id": 10
    },
    {
      "name": "Терминатор: Тёмные судьбы",
      "releaseYear": 2019,
      "genres": [
        "фантастика",
        "боевик",
        "приключения"
      ],
      "poster": [],
      "description": "Мексика. Милая девушка Даниэла Рамос, а для друзей просто Дани, вместе с братом приходит с утра работать на завод, но там выясняется, что их вскоре заменят автоматикой. И это не единственная угроза, которую представляют для девушки машины: тут же на неё нападает присланная из будущего и практически неубиваемая модель терминатора REV-9. Но на защиту Дани встает Грэйс - тоже прибывшая из будущего женщина, модифицировавшая свои боевые характеристики до терминаторского уровня. Вскоре к ним на помощь придёт и Сара Коннор, которая теперь превратилась в настоящую охотницу на роботов-убийц.",
      "viewed": false,
      "favorite": false,
      "id": 11
    },
    {
      "name": "Вечное сияние чистого разума",
      "releaseYear": 2004,
      "genres": [
        "мелодрама",
        "фантастика",
        "драма"
      ],
      "poster": [],
      "description": "Застенчивый и меланхоличный Джоэл живёт ничем не примечательной серой и унылой жизнью. Но однажды вместо привычного рабочего маршрута молодой человек вдруг садится на электричку в другом направлении и устремляется к морю. На песчаном берегу Джоэл замечает девушку с ярко-синими волосами. На обратном пути они знакомятся в вагоне электрички и парень понимает, что у них с Клементиной очень много общего, как будто он уже знает эту девушку. Совсем скоро Джоэл поймёт, что действительно был знаком с ней, более того - они были парой.",
      "viewed": false,
      "favorite": true,
      "id": 12
    },
    {
      "name": "Форсаж",
      "releaseYear": 2001,
      "genres": [
        "боевик",
        "триллер",
        "криминал"
      ],
      "poster": [],
      "description": "Его зовут Брайан, и он — фанат турбин и нитроускорителей. Он пытается попасть в автобанду легендарного Доминика Торетто, чемпиона опасных и незаконных уличных гонок. Брайан также полицейский, и его задание — втереться в доверие к Торетто, подозреваемому в причастности к дерзким грабежам грузовиков, совершаемым прямо на ходу.",
      "viewed": false,
      "favorite": false,
      "id": 13
    },
    {
      "name": "Двойной форсаж",
      "releaseYear": 2003,
      "genres": [
        "боевик",
        "триллер",
        "криминал"
      ],
      "poster": [],
      "description": "Бывший полицейский Брайан О`Коннер с напарником Романом Пирсом собирается перевезти крупную сумму грязных денег известного мафиози Картера Верона. Но на самом деле эта работа является только прикрытием для Брайана, который вместе с тайным агентом Моникой Фуэнтес должен уличить изворотливого преступника.",
      "viewed": false,
      "favorite": false,
      "id": 14
    },
    {
      "name": "Форсаж 5",
      "releaseYear": 2011,
      "genres": [
        "боевик",
        "триллер",
        "криминал"
      ],
      "poster": [],
      "description": "Бывший полицейский Брайан О`Коннер вместе с бывалым лихачом Домиником Торетто совсем немного увлеклись жизнью вне закона. После того, как Брайан и Миа Торетто освободили Доминика, они не рискуют долго задерживаться на одном месте, так как являются желанной целью порядком недовольных копов.",
      "viewed": false,
      "favorite": false,
      "id": 17
    },
    {
      "name": "Форсаж 6",
      "releaseYear": 2013,
      "genres": [
        "боевик",
        "триллер",
        "драма",
        "криминал"
      ],
      "poster": [],
      "description": "тутит тутит",
      "viewed": false,
      "favorite": false,
      "id": 19
    },
    {
      "name": " Форсаж 7",
      "releaseYear": 2015,
      "genres": [
        "боевик",
        "криминал",
        "приключения"
      ],
      "poster": [],
      "description": "Они покорили Токио и Рио, Лос-Анджелес и Лондон. Но мир больше не играет по их правилам. Зной арабских пустынь, неприлично высокие небоскребы, миллионы долларов на колесах и очень, очень знаменитый злодей. Скорость не знает границ.",
      "viewed": false,
      "favorite": false,
      "id": 21
    },
    {
      "name": "Форсаж 9",
      "releaseYear": 2021,
      "genres": [
        "боевик",
        "криминал",
        "приключения"
      ],
      "poster": [],
      "description": "Доминик Торетто ведет спокойную жизнь в глуши вместе с Летти и сыном Брайаном, но опасность всегда где-то рядом. Команде приходится снова собраться, чтобы спасти Мистера Никто после крушения самолёта, на котором перевозили пойманную хакершу Сайфер. На месте аварии команда обнаруживает загадочное устройство и вскоре сталкивается с опасным преступником и самым безбашенным водителем из всех, с кем они имели дело. Ситуация усложняется тем, что этот человек — брат Доминика Джейкоб, которого много лет назад изгнали из семьи.",
      "viewed": false,
      "favorite": false,
      "id": 25
    },
    {
      "name": "Форсаж 12",
      "releaseYear": 2050,
      "genres": [
        "боевик",
        "приключения"
      ],
      "poster": [],
      "description": "Пути пути",
      "viewed": false,
      "favorite": false,
      "id": 29
    },
    {
      "name": "Матрица. Революция",
      "releaseYear": 2003,
      "genres": [
        "фантастика",
        "боевик"
      ],
      "poster": [],
      "description": "Пока армия машин пытается уничтожить Зион, его жители из последних сил держат оборону.",
      "viewed": false,
      "favorite": false,
      "id": 30
    },
    {
      "name": "Матрица: Воскрешение",
      "releaseYear": 2021,
      "genres": [
        "фантастика",
        "боевик"
      ],
      "poster": [],
      "description": "Геймдизайнер Томас Андерсон сделал себе имя работой над трилогией игр «Матрица». Хотя окружающий мир периодически даёт сбои и обнажает свою истинную сущность, бывший Нео исправно посещает психотерапевта, принимает пилюли и практически убедил себя, что всё это — игра его воображения. Но однажды на него выходит хакерша Багз и предлагает снова следовать за белым кроликом.",
      "viewed": false,
      "favorite": false,
      "id": 31
    },
    {
      "name": "Аватар: Путь воды",
      "releaseYear": 2022,
      "genres": [
        "фантастика",
        "фэнтези",
        "боевик",
        "приключения"
      ],
      "poster": [],
      "description": "После принятия образа аватара солдат Джейк Салли становится предводителем народа на'ви и берет на себя миссию по защите новых друзей от корыстных бизнесменов с Земли. Теперь ему есть за кого бороться — с Джейком его прекрасная возлюбленная Нейтири. Когда на Пандору возвращаются до зубов вооруженные земляне, Джейк готов дать им отпор.",
      "viewed": false,
      "favorite": false,
      "id": 32
    },
    {
      "name": "Человек из стали",
      "releaseYear": 2013,
      "genres": [
        "фантастика",
        "боевик",
        "приключения"
      ],
      "poster": [
        "http://localhost:3000/posters/BqTSgi4Pr_2_oVDs2C8ay--1920x (4).webp"
      ],
      "description": "Кларк Кент (Кал-Эл) - молодой человек, который чувствует себя чужаком из-за своей невероятной силы. Много лет назад он был отправлен на Землю с развитой планеты Криптон, и теперь задается вопросом: зачем?  Воспитанный приемными родителями Мартой и Джонатаном Кентами, Кларк знает: обладать сверхспособностями - значит принимать сложные решения. Но когда человечество более всего нуждается в стабильности, оно подвергается нападению. Сможет ли герой восстановить мир или воспользуется своей силой для того, чтобы окончательно его разрушить?",
      "viewed": false,
      "favorite": true,
      "id": 33
    },
    {
      "name": "Чёрный Адам",
      "releaseYear": 2022,
      "genres": [
        "фантастика",
        "фэнтези",
        "боевик",
        "приключения"
      ],
      "poster": [
        "http://localhost:3000/posters/4A8Bjc7UJj0VwNUulflB8--i (13).webp"
      ],
      "description": "5000 лет назад Чёрный Адам был наделен силами египетских богов и заключён в тюрьму. Теперь он освобождается из своей усыпальницы и готовится явить миру уникальный подход к борьбе за справедливость.",
      "viewed": false,
      "favorite": false,
      "id": 34
    },
    {
      "name": "Человек муравей",
      "releaseYear": 2015,
      "genres": [
        "фантастика",
        "боевик",
        "комедия",
        "приключения"
      ],
      "poster": [],
      "description": "цпцпцп",
      "viewed": false,
      "favorite": false,
      "id": 36
    },
    {
      "name": "Проект «Адам»",
      "releaseYear": 2021,
      "genres": [
        "фантастика",
        "боевик",
        "комедия",
        "приключения"
      ],
      "poster": [],
      "description": "Путешествующий во времени пилот Адам Рид совершает аварийную посадку в 2022 году и вместе с собой 12-летним отправляется спасать будущее.",
      "viewed": false,
      "favorite": false,
      "id": 41
    },
    {
      "name": "Главный герой",
      "releaseYear": 2021,
      "genres": [
        "фантастика",
        "боевик",
        "комедия",
        "мелодрама"
      ],
      "poster": [],
      "description": "фафафф",
      "viewed": false,
      "favorite": true,
      "id": 42
    }
  ]
}